---
kind: other
id: Properties.T:Autodesk.Revit.DB.BaseImportOptions
source: html/b7440075-ebac-4f12-95aa-e14de29a24b6.htm
---
# BaseImportOptions Properties

Correct almost-vertical lines and almost-horizontal lines for import model
 if option is set to true, the almost-vertical lines would be vertical lines and almost-horizontal lines would be horizontal lines.